src/Tasks/ЗадачаОтветственному/ЗадачаОтветственному.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаОтветственному</name>
  <attributes>
    <name>ИмяВызываемогоМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОткрываемойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗадачи</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>CatalogRef.ТипыЗадачКонтрольМониторингСистемныхОшибок</types>
      <types>CatalogRef.ТипыЗадачСборДампов</types>
      <types>CatalogRef.ТипыЗадачАнализВызововКластера1С</types>
      <types>CatalogRef.ТипыЗадач</types>
      <types>CatalogRef.ТипыЗадачОценкаПользователей</types>
      <types>CatalogRef.ТипыЗадачКонтрольПроизводительности</types>
      <types>CatalogRef.ТипыЗадачКонтрольПамяти</types>
      <types>CatalogRef.ТипыЗадачКонтрольНагрузочныхТестов</types>
      <types>CatalogRef.ТипыЗадачКонтрольПодключений</types>
      <types>CatalogRef.ТипыЗадачВнешнийКонтрольЦКК</types>
      <types>CatalogRef.ТипыЗадачКонтрольРегламентныхЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаОтветственномуЗаВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачиИзменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСтраницыСправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяемыеПараметрыЗадачи</name>
    <type>
      <types>CatalogRef.ОписаниеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоручениеДополнительныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОписаниеПоручения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекстОповещения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОткрытияФормы</name>
    <attributes>
      <name>ИмяПараметра</name>
      <comment>Имя параметра может быть составным, например, &quot;Объект.Владелец&quot;.</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьПриСозданииНаСервере</name>
      <comment>Использовать параметр при создании формы на сервере</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыЗадачи</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ВариантыДампов</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Инциденты</name>
    <comment>Инциденты</comment>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформацияОбИнциденте</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ТипыИсполнителейКонтрольПамяти</types>
      <types>CatalogRef.ТипыИсполнителей</types>
      <types>CatalogRef.ТипыИсполнителейВнешнийКонтрольЦКК</types>
      <types>CatalogRef.ТипыИсполнителейАнализВызововКластера1С</types>
      <types>CatalogRef.ТипыИсполнителейОценкаПользователей</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПодключений</types>
      <types>CatalogRef.ТипыИсполнителейСборДампов</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПроизводительности</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольРегламентныхЗаданий</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольЧислаИсключений</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольНагрузочныхТестов</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/Enums/СостоянияКонтрольныхПроцедур/СостоянияКонтрольныхПроцедур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКонтрольныхПроцедур</name>
  <enumValues>
    <name>ВыполненаУспешноПроблемНет</name>
  </enumValues>
  <enumValues>
    <name>НеизвестноеСостояние</name>
  </enumValues>
  <enumValues>
    <name>ВыполненаУспешноЕстьПроблемы</name>
  </enumValues>
  <enumValues>
    <name>ПрерванаЕстьПроблемы</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КонтрольныеПроцедуры/КонтрольныеПроцедуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольныеПроцедуры</name>
  <owners>Catalog.ВидыКонтрольныхПроцедур</owners>
  <attributes>
    <name>Выполнять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пауза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеактивацияТолькоСлужебныхЗадачПриОтключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИзменилось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сохранено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОСбое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОВосстановлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИнцидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоЗакрытиеИнцидента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительноеОповещение</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОповещенияПриСбое</name>
    <attributes>
      <name>Оповещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОповещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Tasks/ЗадачаОтветственному/Forms/ФормаЗадачи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		ОбновитьРекомендации();
		
		ДобавитьКомандуНаФорму(
		"ОбъектКонтроля",
		"Настройки объекта контроля",
		"Справочник.ОбъектыКонтроля.Форма.ФормаЭлемента",
		Новый Структура("Ключ", Объект.ИсточникЗадачи.ОбъектКонтроля)		
		);
		
		ДобавитьКомандуНаФорму(
		"ПроцедураКонтроля",
		"Настройки контрольной процедуры",
		"Справочник.КонтрольныеПроцедуры.Форма.ФормаЭлемента", 
		Новый Структура("Ключ, ЗаблокироватьПанельУправления", Объект.ИсточникЗадачи, Истина)
		);
		
		ВнешниеФормы = УправлениеЗадачами.НазванияВнешнихФормДляВидаПроцедуры(
		Объект.ИсточникЗадачи.Владелец, 
		Объект.ТипЗадачи
		);
		НомерФормы = 1;
		Для Каждого ВнешняяФорма ИЗ ВнешниеФормы Цикл
			ПараметрыОткрытия = Новый Структура(
			"ОбъектКонтроля, Дата", 
			Объект.ИсточникЗадачи.ОбъектКонтроля,
			Строка(Объект.Дата)
			);
			Для Каждого ПараметрЗадачи Из Объект.ПараметрыЗадачи Цикл
				ПараметрыОткрытия.Вставить(ПараметрЗадачи.ИмяПараметра, ПараметрЗадачи.Значение);
			КонецЦикла;	
			
			ДобавитьКомандуНаФорму(
			"ОткрытиеВнешнейФормы" + Строка(НомерФормы),
			ВнешняяФорма.Значение,
			ВнешняяФорма.Ключ, 
			ПараметрыОткрытия
			);
			НомерФормы = НомерФормы + 1;
		КонецЦикла;	
		
		Если ПустаяСтрока(Объект.ИзменяемыеПараметрыЗадачи.ПоручениеДополнительныеДанные) Тогда
			Элементы.ПоручениеДополнительныеДанные.Видимость = Ложь;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуНаФорму(ИмяКоманды, Заголовок, ИмяФормы, ПараметрыОткрытия)
	
	НоваяКоманда = Команды.Добавить(ИмяКоманды); 
	НоваяКоманда.Действие = "ОткрытьВспомогательнуюФорму"; 
	
	НовыйЭлемент = Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"),Элементы.ГруппаПерейти); 
	НовыйЭлемент.ИмяКоманды = ИмяКоманды; 
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.Заголовок = Заголовок;
	
	ТекущиеПараметры = РеквизитФормыВЗначение("СсылкиНаВнешниеФормы");
	НоваяСтрока = ТекущиеПараметры.Добавить();
	НоваяСтрока.ИмяКоманды = ИмяКоманды;
	НоваяСтрока.ИмяФормы = ИмяФормы;
	
	Для Каждого ИмяЗначениеПараметра Из ПараметрыОткрытия Цикл
		НоваяСтрока = ТекущиеПараметры.Добавить();
		НоваяСтрока.ИмяКоманды = ИмяКоманды;

		НоваяСтрока.ИмяПараметраОткрытия = ИмяЗначениеПараметра.Ключ;
		НоваяСтрока.ЗначениеПараметраОткрытия = ИмяЗначениеПараметра.Значение;
	КонецЦикла;	
		
	ЗначениеВРеквизитФормы(ТекущиеПараметры, "СсылкиНаВнешниеФормы");
КонецПроцедуры	

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// После выполнения задачи, мы должны убедиться, что
	// задача действительно выполнена.
	// Для этого нужно заново запустить бизнес-процесс. 
	// Проблема в том, что часть задач связаны с бизнес-процессами и 
	// выполнение таких задач автоматически перезапускает связанный бизнес-процесс,
	// а часть часть задач было удобно сделать не привязанными к точкам бизнес-процессов.
	// Последний тип задач требует ручного перезапуска бизнес-процессов.
	Если ТекущийОбъект.Выполнена И ТекущийОбъект.ТочкаМаршрута = Неопределено Тогда
		Если ТекущийОбъект.ТипЗадачи.ПроверятьПриВыполнении Тогда
			УправлениеЗаданиямиСервер.УстановитьСостояниеКонтрольнойПроцедуры(
				Объект.ИсточникЗадачи,
				Перечисления.СостоянияКонтрольныхПроцедур.НеизвестноеСостояние
			);
			Если Объект.ИсточникЗадачи.Выполнять Тогда 
				ПараметрыЗапуска = Новый Массив;
				ПараметрыЗапуска.Добавить(Объект.ИсточникЗадачи);
				ФоновыеЗадания.Выполнить("УправлениеЗаданиямиСервер.ЗапускКонтрольнойПроцедуры", ПараметрыЗапуска); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Объект.Выполнена Тогда
		Оповестить("Изменение.Задачи", Объект.ИсточникЗадачи, Объект.Ссылка);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция НазваниеСтраницыСправки()
	Если ТипЗнч(Объект.ИсточникЗадачи) = Тип("СправочникСсылка.КонтрольныеПроцедуры") Тогда
		
		Возврат ?(ПустаяСтрока(Объект.ИмяСтраницыСправки), Неопределено, Объект.ИмяСтраницыСправки);	
		
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОткрытьВспомогательнуюФорму(Команда)
	ПараметрыФормы = ПараметрыВнешнейФормы(Команда.Имя);
		
	ОткрытьФорму(
		ПараметрыФормы.ИмяФормы,
		ПараметрыФормы.ПараметрыОткрытия
	);
	
КонецПроцедуры	

&НаСервере
Функция ПараметрыВнешнейФормы(ИмяКоманды)
	
	СтрокиПараметров = СсылкиНаВнешниеФормы.НайтиСтроки(
		Новый Структура("ИмяКоманды", ИмяКоманды)
	);
	
	Результат = Новый Структура; 
	ПараметрыОткрытия = Новый Структура;
	Для Каждого СтрокаПараметров Из СтрокиПараметров Цикл
		Если НЕ ПустаяСтрока(СтрокаПараметров.ИмяФормы) Тогда
			Результат.Вставить("ИмяФормы", СтрокаПараметров.ИмяФормы);
		КонецЕсли;
		Если НЕ ПустаяСтрока(СтрокаПараметров.ИмяПараметраОткрытия) Тогда
			ПараметрыОткрытия.Вставить(
				СтрокаПараметров.ИмяПараметраОткрытия, 
				СтрокаПараметров.ЗначениеПараметраОткрытия
			);		
		КонецЕсли;
	КонецЦикла;	
	Результат.Вставить("ПараметрыОткрытия", ПараметрыОткрытия);
	Возврат Результат;
		
КонецФункции

&НаСервере
Процедура ОбновитьРекомендации()
	ИмяМакета = НазваниеСтраницыСправки();
	Если ИмяМакета <> Неопределено Тогда
		Попытка 
			Справка = Общий.ТекстHTMLМакета(ИмяМакета); 
		Исключение
			Инфо = ИнформацияОбОшибке();
			Комментарий =
				"Описание = '" +Инфо.Описание + "', " +
				"ИмяМодуля = '" + Инфо.ИмяМодуля + "', " +
				"НомерСтроки = '" + Инфо.НомерСтроки + "', " +
				"ИсходнаяСтрока = '" + Инфо.ИсходнаяСтрока + "'.";
			
			ЗаписьЖурналаРегистрации(
				"Процедура ОбновитьРекомендации()",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Задачи.ЗадачаОтветственному.Формы.ФормаЗадачи,
				,
				Комментарий);
			
			Элементы.Рекомендации.Видимость = Ложь;
		КонецПопытки;
	Иначе
		Элементы.Рекомендации.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
